Revit 2026 API

# TriangulatedShellComponent Properties

---

The TriangulatedShellComponent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsClosed | True if and only if the triangulation represents a topologically closed shell (i.e., each edge is shared by two triangles). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TriangleCount | The number of triangles in the triangulation. |
|  | VertexCount | The number of vertices in the triangulation. |

#### Reference

TriangulatedShellComponent Class

Autodesk.Revit.DB Namespace